/*********************************************************************************************
* 文件：iic.c
* 作者：zonesion
* 说明：iic驱动程序
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "iic.h"
#include "delay.h"

/*********************************************************************************************
* 名称：iic_delay_us()
* 功能：延时函数
* 参数：t -- 延时设置
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void  iic_delay_us(unsigned int t)
{
  while(t--)
  {
    delay_us(1);
  }
}

/*********************************************************************************************
* 名称：iic_init()
* 功能：I2C初始化函数
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void iic_init(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  
  RCC_APB2PeriphClockCmd(I2C_SCL_RCC, ENABLE);
  GPIO_InitStructure.GPIO_Pin =  I2C_SCL_PIN;
  GPIO_Init(I2C_SCL_GPIO, &GPIO_InitStructure); 
  
  RCC_APB2PeriphClockCmd(I2C_SDA_RCC, ENABLE);
  GPIO_InitStructure.GPIO_Pin =  I2C_SDA_PIN;
  GPIO_Init(I2C_SDA_GPIO, &GPIO_InitStructure); 
  
  SDA_H;
  SCL_H;
}

/*********************************************************************************************
* 名称：iic_start()
* 功能：I2C起始信号
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void iic_start(void)
{
  SDA_OUT();
  SDA_H;                                                      //拉高数据线
  SCL_H;                                                      //拉高时钟线
  iic_delay_us(5);                                              //延时
  SDA_H;                                                      //产生下降沿
  iic_delay_us(5);                                              //延时
  SCL_L;                                                      //拉低时钟线
}

/*********************************************************************************************
* 名称：iic_stop()
* 功能：I2C停止信号
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void iic_stop(void)
{
  SDA_OUT();
  SDA_L;                                                       //拉低数据线
  SCL_H;                                                       //拉高时钟线
  iic_delay_us(5);                                              //延时5us
  SDA_H;                                                        //产生上升沿
  iic_delay_us(5);                                              //延时5us
}

/*********************************************************************************************
* 名称：iic_send_ack()
* 功能：I2C发送应答
* 参数：ack -- 应答信号
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void iic_send_ack(int ack)
{
  SDA_OUT();
  if(ack)
    SDA_H;
  else
    SDA_L;
  SCL_H;                                                      //拉高时钟线
  iic_delay_us(5);                                              //延时
  SCL_L;                                                      //拉低时钟线
  iic_delay_us(5);                                              //延时
}

/*********************************************************************************************
* 名称：iic_recv_ack()
* 功能：I2C接收应答
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
int iic_recv_ack(void)
{
  int CY = 0;
  SDA_IN();
  SCL_H;                                                      //拉高时钟线
  iic_delay_us(5);                                              //延时
  CY = SDA_R;                                                   //读应答信号
  SCL_L;                                                      //拉低时钟线
  iic_delay_us(5);                                              //延时
  return CY;
}

/*********************************************************************************************
* 名称：iic_write_byte()
* 功能：I2C写一个字节数据，返回ACK或者NACK，从高到低，依次发送
* 参数：data -- 要写的数据
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
unsigned char iic_write_byte(unsigned char data)
{
  unsigned char i;
  SDA_OUT();
  SCL_L;                                                      //拉低时钟线
  for(i = 0;i < 8;i++){                                         
    if(data & 0x80){                                            //判断数据最高位是否为1
      SDA_H;	                                                
    }
    else
      SDA_H;
    iic_delay_us(5);                                            //延时5us
    SCL_H;	                                                //输出SDA稳定后，拉高SCL给出上升沿，从机检测到后进行数据采样
    iic_delay_us(5);                                            //延时5us
    SCL_L;                                                    //拉低时钟线
    iic_delay_us(5);                                            //延时5us
    data <<= 1;                                                 //数组左移一位
  } 
  iic_delay_us(2);                                              //延时2us
  SDA_H;                                                      //拉高数据线
  SCL_H;                                                      //拉高时钟线
  
  SDA_IN();
  iic_delay_us(2);                                              //延时2us，等待从机应答
  if(SDA_R == 1){			                                //SDA为高，收到NACK
    return 1;	
  }else{ 				                        //SDA为低，收到ACK
    SCL_L;
    iic_delay_us(50);
    return 0;
  }
}

/*********************************************************************************************
* 名称：iic_read_byte()
* 功能：I2C写一个字节数据，返回ACK或者NACK，从高到低，依次发送
* 参数：data -- 要写的数据
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
unsigned char iic_read_byte(unsigned char ack)
{
  unsigned char i,data = 0;
  SCL_L;
  SDA_H;			                                //释放总线	
  SDA_IN();
  for(i = 0;i < 8;i++){
    SCL_H;		                                        //给出上升沿
    iic_delay_us(30);	                                        //延时等待信号稳定
    data <<= 1;	
    if(SDA_R == 1){ 		                                //采样获取数据
      data |= 0x01;
    }else{
      data &= 0xfe;
    }
    iic_delay_us(10);
    SCL_L;   		                                        //下降沿，从机给出下一位值
    iic_delay_us(20);
  }   
  
  SDA_OUT();
  if(ack)
    SDA_H;
  else
    SDA_L;                                   //应答状态
  iic_delay_us(10);
  SCL_H;                         
  iic_delay_us(50);          
  SCL_L;
  iic_delay_us(50);
  return data;
}

/*********************************************************************************************
* 名称：delay()
* 功能：延时
* 参数：t -- 设置时间
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void delay(unsigned int t)
{
  unsigned char i;
  while(t--){
    for(i = 0;i < 200;i++);
  }					   
}
